#include "delay.h"
#include "IIC.h"
#include "stm32f10x.h"                  // Device header


#define AT24C02_ADDR 0xA0  //AT24c02  IIC地址

/******************************************************************************
 * 函数名称: Read_AT24C02
 * 函数功能: 读取24C02的指定寄存器值返回到data里
 * 入口参数: 寄存器地址
 * 返回值：读出数值
 * 备注:
 ******************************************************************************/
uint16_t Read_AT24C02(uint8_t addr)
{
	uint16_t data;
	IIC_read_Bytes(AT24C02_ADDR,addr,(uint8_t*)&data,2);
	return data; //返回已当前组数据是否曾经被写入的标志位供使用者思考是否再次写入
}

/******************************************************************************
 * 函数名称: Write_AT24C02
 * 函数功能: 写入24C02的指定寄存器
 * 入口参数: addr 寄存器地址，data 写入数据
 * 返回值：无
 * 备注:
 ******************************************************************************/
void Write_AT24C02(uint8_t addr, uint16_t data)
{
	delay_ms(10);
	IIC_Write_Bytes(AT24C02_ADDR,addr,(uint8_t*)&data,2);
}

/******************************************************************************
 * 函数名称: Test_AT24C02
 * 函数功能: 测试AT24C02是否能正常运行
 * 入口参数:无
 * 返回值：0 测试失败，1 测试成功
 * 备注:
 *****************************************************************************printf("%d,%d\r\n",offset.pitch,e);*/
uint8_t Test_AT24C02(void)
{
	uint8_t test = 0;
	
	IIC_Write_One_Byte(AT24C02_ADDR,0x55,0xAA);//往0x55写入0xAA
	delay_ms(500);
	test = IIC_Read_One_Byte(AT24C02_ADDR,0x55);//从0x55读数据
	
	if(test !=0xAA)//测试是否和写入值相同
	{
		return 1;//失败
	}
	else 
	{
		return 0;//成功
	}
	
}




